//
//  ArrayInfoCar.swift
//  Diplom_Car
//
//  Created by Дмитрий Сазановец on 6/25/22.
//

import Foundation
import SwiftUI

class ArrayInfoCar {
    var typeTVList = ["Мототранспорт", "Легковой транспорт", "Грузовой транспорт", "Автобус", "Прицеп", "Полуприцеп", "Водный транспорт", "Сельхозтранспорт", "Специальный транспорт"]
    
    var typeFuelTVList = ["Дизель", "Бензин", "Электро", "Дизель (гибрид)", "Бензин (гибрид)", "Бензин (метан)", "Бензин (пропан-бутан)"]
    
    var colorTVList = ["Золотистый", "Серебристый", "Серый", "Черный", "Белый", "Красный", "Синий", "Желтый", "Коричневый", "Бордовый", "Зеленый", "Фиолетовый", "Оранжевый", "Другой"]
    
    var typeService = ["ТО","Масло с фильтрами", "Салонный фильтр", "Тормозные диски и колодки", "Переобувка", "Ремень ГРМ", "Помпа", "Подвеска", "Аккумулятор", "Коробка передач", "Свечи", "Щетки дворников", "Турбина", "Двигатель", "Кузов", "Другое"]
    var typeDock = ["Штраф", "Страховка", "КАСКО", "Допуск", "Эвакуация", "Налог", "Другой"]
    
    var ageTVList: [String] = []
    
    var typeEngineList: [String] = []
    
    func updateArray() {
        for i in 10...90 {
            self.typeEngineList.append(String(Double(i)/10))
        }
        var age = Array(1910...2022)
        age.sort(){$0 > $1}
        self.ageTVList = age.map { $0.description }
    }
    
    init() {
        
    }
}
